
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/koyashiro/infra/actions/runs/8724351457)



<pre><code>Apply complete! Resources: 11 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.cname_root: Refreshing state... [id=d58e18342013a85711948497d1a02b1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_vpm will be created
  + resource "cloudflare_record" "cname_vpm" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vpm"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "vpm-repos.pages.dev"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt1 will be created
  + resource "cloudflare_record" "mx_alt1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt1.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt2 will be created
  + resource "cloudflare_record" "mx_alt2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 5
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt2.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt3 will be created
  + resource "cloudflare_record" "mx_alt3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt3.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_alt4 will be created
  + resource "cloudflare_record" "mx_alt4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "alt4.aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.mx_primary will be created
  + resource "cloudflare_record" "mx_primary" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = "aspmx.l.google.com"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_discord will be created
  + resource "cloudflare_record" "txt_discord" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_discord"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "dh=2f7777c55cca3b5519378571f05bd3979da45d38"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_google_domainkey will be created
  + resource "cloudflare_record" "txt_google_domainkey" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAyhioqL5nv/wDnkrmguw+J1qpm2fsLev+PKZMVVCLuGurD/6UJUscAFRN5xpjbP4DOsTmQtP/pTj8M0+9DkRItkuJUGCb9U9DMi3MN2Ll9BAaEfKFUDg9OEudIW/kWBhawkQpKA1DREu/bnZPr8VvwcyrO+DhPRUHYsylEPWrCY8EdDSv4U/m4a2kc79l1aJLo3iC542LStRNw70ls8hKHWC8+49vup2FFWFn9ktSgQs21A5hDY+VB/vEnpqCyN8R+VP0q5QgmAxvwWtfGQ11kIE82+p6OOI2RNPHYt5wHlPtmyZCZh28l3PRrdzXXOJiV9KvC9FuAvJmHUuu9OoF5wIDAQAB"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_google_suite_verification will be created
  + resource "cloudflare_record" "txt_google_suite_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "google-site-verification=7-AYDWnsMkam_BpKeKWqjbeTqglhrp80t1N4RtKg6gQ"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "keybase-site-verification=fFkMCr9xX06WBiCVODi28op8DCxmwfcYIN-iFSqEiwk"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "v=spf1 include:koyashiro.net ~all"
      + zone_id         = "5c9548a1eb6b1c26ae99f449beaf3dbb"
    }

Plan: 11 to add, 0 to change, 0 to destroy.
cloudflare_record.mx_primary: Creating...
cloudflare_record.txt_google_suite_verification: Creating...
cloudflare_record.mx_alt1: Creating...
cloudflare_record.txt_discord: Creating...
cloudflare_record.txt_google_domainkey: Creating...
cloudflare_record.mx_alt3: Creating...
cloudflare_record.mx_alt4: Creating...
cloudflare_record.mx_alt2: Creating...
cloudflare_record.cname_vpm: Creating...
cloudflare_record.txt_spf: Creating...
cloudflare_record.txt_google_suite_verification: Creation complete after 2s [id=51aed5edfda688a4954fa9512bd6b0c7]
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.mx_primary: Creation complete after 3s [id=1ddf6f336013779c232ec6a394367d77]
cloudflare_record.mx_alt4: Creation complete after 3s [id=219a76a69f8880eeae68cc527fdf64a0]
cloudflare_record.txt_discord: Creation complete after 3s [id=6c2a03277c1c0316279abe5f302c5745]
cloudflare_record.mx_alt2: Creation complete after 4s [id=b739db8088696aca278313b2ee3e21c8]
cloudflare_record.mx_alt1: Creation complete after 4s [id=b42c903d6fe8ebe5dce8544e7cd1f86c]
cloudflare_record.txt_spf: Creation complete after 4s [id=de681523c30bfdbf10f37cbe9cdff23a]
cloudflare_record.cname_vpm: Creation complete after 4s [id=2ecd27a583d3aa5d7c8ee4db71d77bc1]
cloudflare_record.txt_google_domainkey: Creation complete after 4s [id=317848469b58e65bc4d786cafab3c252]
cloudflare_record.mx_alt3: Creation complete after 5s [id=b992ff41459ab3f5b0e8dcc2bc694827]
cloudflare_record.txt_keybase_site_verification: Creation complete after 3s [id=08a9aea85efa8460b0e4ffcf4e9c1a0f]

Apply complete! Resources: 11 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":141,"Program":"tfcmt","SHA1":"1bd82e91d0858275f2f976b7c191906fc1512cf9","Vars":{},"WorkflowName":"terraform"} -->